<a href="https://colab.research.google.com/github/samucale/Resolucao-exercicios-python/blob/master/Aula_10_Analisando_e_Filtrando_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd

In [31]:
df = pd.read_csv ('/content/drive/MyDrive/Colab ciencia de dados /arquivodetreino/titaniclimpo.csv')

In [32]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title', 'Family_Size'],
      dtype='object')

In [33]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [35]:
df.head ()

    Age Cabin Embarked     Fare  ... Survived            Ticket  Title  Family_Size
0  22.0   NaN        S   7.2500  ...      0.0         A/5 21171     Mr            1
1  38.0   C85        C  71.2833  ...      1.0          PC 17599    Mrs            1
2  26.0   NaN        S   7.9250  ...      1.0  STON/O2. 3101282   Miss            0
3  35.0  C123        S  53.1000  ...      1.0            113803    Mrs            1
4  35.0   NaN        S   8.0500  ...      0.0            373450     Mr            0

[5 rows x 14 columns]

In [36]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [37]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [38]:
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  , 30.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 35.5 , 34.  , 15.  ,
       28.  ,  8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,
        7.  , 49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  ,
       32.  , 16.  , 25.  ,  0.83, 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [39]:
df['Age'].unique ()

array([22.  , 38.  , 26.  , 35.  , 30.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 35.5 , 34.  , 15.  ,
       28.  ,  8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,
        7.  , 49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  ,
       32.  , 16.  , 25.  ,  0.83, 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [40]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [41]:
df['Age'].value_counts()

30.00    144
22.00     63
24.00     30
18.00     26
28.00     25
        ...
36.50      1
66.00      1
55.50      1
23.50      1
0.42       1
Name: Age, Length: 89, dtype: int64

In [43]:
df['Age'].mean()

29.44519640852974

In [44]:
df['Age'].median()

30.0

In [45]:
df['Age'].mode()

0    30.0
dtype: float64

In [46]:
df['Age'].var()

175.42726791081836

In [47]:
df.describe

<bound method NDFrame.describe of       Age Cabin Embarked  ...            Ticket Title  Family_Size
0    22.0   NaN        S  ...         A/5 21171    Mr            1
1    38.0   C85        C  ...          PC 17599   Mrs            1
2    26.0   NaN        S  ...  STON/O2. 3101282  Miss            0
3    35.0  C123        S  ...            113803   Mrs            1
4    35.0   NaN        S  ...            373450    Mr            0
..    ...   ...      ...  ...               ...   ...          ...
886  27.0   NaN        S  ...            211536   Rev            0
887  19.0   B42        S  ...            112053  Miss            0
888  22.0   NaN        S  ...        W./C. 6607  Miss            3
889  26.0  C148        C  ...            111369    Mr            0
890  32.0   NaN        Q  ...            370376    Mr            0

[891 rows x 14 columns]>

In [51]:
df.drop_duplicates ()

      Age Cabin Embarked  ...            Ticket Title  Family_Size
0    22.0   NaN        S  ...         A/5 21171    Mr            1
1    38.0   C85        C  ...          PC 17599   Mrs            1
2    26.0   NaN        S  ...  STON/O2. 3101282  Miss            0
3    35.0  C123        S  ...            113803   Mrs            1
4    35.0   NaN        S  ...            373450    Mr            0
..    ...   ...      ...  ...               ...   ...          ...
886  27.0   NaN        S  ...            211536   Rev            0
887  19.0   B42        S  ...            112053  Miss            0
888  22.0   NaN        S  ...        W./C. 6607  Miss            3
889  26.0  C148        C  ...            111369    Mr            0
890  32.0   NaN        Q  ...            370376    Mr            0

[891 rows x 14 columns]

**Filtragem de Dados (Máscaras)**

In [52]:
df['Age']>25

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [56]:
df['Age']<23

0       True
1      False
2      False
3      False
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [58]:
df[df['Age']>25]

      Age Cabin Embarked  ...            Ticket Title  Family_Size
1    38.0   C85        C  ...          PC 17599   Mrs            1
2    26.0   NaN        S  ...  STON/O2. 3101282  Miss            0
3    35.0  C123        S  ...            113803   Mrs            1
4    35.0   NaN        S  ...            373450    Mr            0
5    30.0   NaN        Q  ...            330877    Mr            0
..    ...   ...      ...  ...               ...   ...          ...
883  28.0   NaN        S  ...  C.A./SOTON 34068    Mr            0
885  39.0   NaN        Q  ...            382652   Mrs            5
886  27.0   NaN        S  ...            211536   Rev            0
889  26.0  C148        C  ...            111369    Mr            0
890  32.0   NaN        Q  ...            370376    Mr            0

[550 rows x 14 columns]

In [59]:
df_female = df[df['Sex']=='female']

In [60]:
df_female.head ()

    Age Cabin Embarked     Fare  ... Survived            Ticket  Title  Family_Size
1  38.0   C85        C  71.2833  ...      1.0          PC 17599    Mrs            1
2  26.0   NaN        S   7.9250  ...      1.0  STON/O2. 3101282   Miss            0
3  35.0  C123        S  53.1000  ...      1.0            113803    Mrs            1
8  27.0   NaN        S  11.1333  ...      1.0            347742    Mrs            2
9  14.0   NaN        C  30.0708  ...      1.0            237736    Mrs            1

[5 rows x 14 columns]